pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.h
//---------------------------------------------------------------------------*
//                                                                           *
//                   File 'pic18_checkingAndBuildIPIC.h'                     *
//                 Generated by version GALGAS_BETA_VERSION                  *
//                    december 31th, 2008, at 18h49'37"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_checkingAndBuildIPIC_DEFINED
#define pic18_checkingAndBuildIPIC_DEFINED

#include <string.h>

//---------------------------------------------------------------------------*

#include "galgas/C_GGS_Object.h"
#include "galgas/GGS_location.h"
#include "galgas/GGS_lbool.h"
#include "galgas/GGS_lchar.h"
#include "galgas/GGS_lstring.h"
#include "galgas/GGS_ldouble.h"
#include "galgas/GGS_luint.h"
#include "galgas/GGS_lsint.h"
#include "galgas/GGS_luint64.h"
#include "galgas/GGS_lsint64.h"
#include "galgas/GGS_stringset.h"
#include "galgas/GGS_binaryset.h"
#include "galgas/GGS_filewrapper.h"
#include "galgas/predefined_types.h"
#include "galgas/AC_galgas_class.h"
#include "galgas/AC_galgas_domain.h"
#include "galgas/AC_galgas_mapindex.h"
#include "galgas/AC_galgas_map.h"
#include "galgas/AC_galgas_listmap.h"
#include "galgas/AC_galgas_list.h"
#include "galgas/AC_galgas_sortedlist.h"

//---------------------------------------------------------------------------*

#include "galgas/C_Lexique.h"

// Include imported semantics
#include "ipic18_metamodel.h"
#include "ipic_generic.h"
#include "pic18_metamodel.h"
#include "piccoloDevice_semantics.h"
#include "piccolo_options.h"

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

//---------------------------------------------------------------------------*
//                                                                           *
//                          Class Predeclarations                            *
//                                                                           *
//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@piccolo_instruction.buildIPICinstructionList'       *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*typeCategoryMethod__piccolo_instruction__buildIPICinstructionList)  (C_Compiler & _inLexique,
                                const cPtr_piccolo_instruction * inObjectPtr,
                                const GGS_uint   var_cas_inAccessBankSplitOffset,
                                const GGS_routineMap   var_cas_inRoutineMap,
                                const GGS_registerTable   var_cas_inRegisterTable,
                                const GGS_constantMap   var_cas_inConstantMap,
                                GGS_uint  & var_cas_ioLocalLabelIndex,
                                GGS_ipic18_instructionList  & var_cas_ioGeneratedInstructionList,
                                GGS_string & var_cas_ioListFileContents,
                                GGS_uint  & var_cas_ioCurrentBank,
                                const GGS_bool  var_cas_inShouldPreserveBSR,
                                GGS_bool & var_cas_ioContinuesInSequence,
                                const GGS_routineKind  var_cas_inRoutineKind
                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void
enterCategoryMethod__piccolo_instruction__buildIPICinstructionList (typeCategoryMethod__piccolo_instruction__buildIPICinstructionList inRoutine,
                     const sint32 inClassID) ;

//---------------------------------------------------------------------------*

typeCategoryMethod__piccolo_instruction__buildIPICinstructionList
findCategoryMethod__piccolo_instruction__buildIPICinstructionList (AC_galgasClassRunTimeInformation * inClassPtr) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                     Routine 'handleInstructionList'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_handleInstructionList (C_Compiler &,
                                const GGS_instructionList  ,
                                const GGS_uint  ,
                                const GGS_routineMap  ,
                                const GGS_registerTable  ,
                                const GGS_constantMap  ,
                                GGS_uint  &,
                                GGS_ipic18_instructionList  &,
                                GGS_string &,
                                GGS_uint  &,
                                const GGS_bool ,
                                GGS_bool &,
                                const GGS_routineKind  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Category method '@conditionExpression.buildIPICinstructionForCondition'   *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*typeCategoryMethod__conditionExpression__buildIPICinstructionForCondition)  (C_Compiler & _inLexique,
                                const cPtr_conditionExpression * inObjectPtr,
                                const GGS_uint   var_cas_inAccessBankSplitOffset,
                                const GGS_uint   var_cas_inCurrentBank,
                                const GGS_registerTable   var_cas_inRegisterTable,
                                GGS_uint  & var_cas_ioLocalLabelIndex,
                                const GGS_bool  var_cas_inComplementaryBranch,
                                const GGS_location   var_cas_inInstructionLocation,
                                const GGS_string  var_cas_inTargetLabel,
                                GGS_ipic18_instructionList  & var_cas_ioGeneratedInstructionList,
                                GGS_string & var_cas_ioListFileContents
                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void
enterCategoryMethod__conditionExpression__buildIPICinstructionForCondition (typeCategoryMethod__conditionExpression__buildIPICinstructionForCondition inRoutine,
                     const sint32 inClassID) ;

//---------------------------------------------------------------------------*

typeCategoryMethod__conditionExpression__buildIPICinstructionForCondition
findCategoryMethod__conditionExpression__buildIPICinstructionForCondition (AC_galgasClassRunTimeInformation * inClassPtr) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@conditionExpression.computeInstructionCountForCondition' *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*typeCategoryMethod__conditionExpression__computeInstructionCountForCondition)  (C_Compiler & _inLexique,
                                const cPtr_conditionExpression * inObjectPtr,
                                const GGS_bool  var_cas_inComplementaryBranch,
                                GGS_uint  & var_cas_outInstructionCount
                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void
enterCategoryMethod__conditionExpression__computeInstructionCountForCondition (typeCategoryMethod__conditionExpression__computeInstructionCountForCondition inRoutine,
                     const sint32 inClassID) ;

//---------------------------------------------------------------------------*

typeCategoryMethod__conditionExpression__computeInstructionCountForCondition
findCategoryMethod__conditionExpression__computeInstructionCountForCondition (AC_galgasClassRunTimeInformation * inClassPtr) ;

//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'build_ipic18_assembly_instruction_list'              *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_build_ipic18_assembly_instruction_list (C_Compiler &,
                                const GGS_routineDeclarationList  ,
                                const GGS_routineDeclarationList  ,
                                const GGS_luint  ,
                                const GGS_uint  ,
                                const GGS_registerTable  ,
                                const GGS_piccoloModel ,
                                const GGS_bool ,
                                const GGS_bool ,
                                GGS_ipic18_instructionList  &,
                                GGS_string & COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

#endif
